Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СпособыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="02bc949c-5e4c-4b15-83c1-a8495643e26c">
    <name>ПорядокСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="69807f2d-19a0-4039-9d55-8a6629b3ee9a">
      <name>гкс_ПроводитьАвтоматически</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3f7b11a-33d2-425a-b6b6-a3b9d3451f37">
      <name>ПроведениеДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="304f1d2e-c348-4b56-9d54-9d830aeb8100">
      <name>ТекущийСтатус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13294823-5282-48a7-ae3c-3980d87974ff">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_НастройкиСтатусовСогласованияДокументов/торо_НастройкиСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="855de82d-7eee-4ce5-918b-4346b60b354b">
  <name>торо_НастройкиСтатусовСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5943df01-c248-4875-9da6-5ae08e091df5">
    <name>гкс_ПроводитьАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// гкс+ [разработка 2021] Куст 13.05.2021
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Вставка
	ДобавитьНовыеЭлементы();
	#КонецВставки

	СсылкаДляМатрицы = ?(ЗначениеЗаполнено(Параметры.ЗначениеКопирования), Параметры.ЗначениеКопирования, Объект.Ссылка);
	ЗаполнитьМатрицуПерехода(СсылкаДляМатрицы);

КонецПроцедуры
// гкс- [разработка 2021] Куст 13.05.2021

// гкс+ [разработка 2021] Куст 28.04.2021
&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура гкс_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	НаборЗаписей = РегистрыСведений.торо_НастройкиСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СпособСогласования.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для каждого Стр Из МатрицаПерехода Цикл
		Стр.НомерСтатуса = МатрицаПерехода.Индекс(Стр);

		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
		НоваяЗапись.Статус = Стр.ТекущийСтатус;
		НоваяЗапись.СпособСогласования = Объект.Ссылка;
	КонецЦикла;

	НаборЗаписей.Записать();

	Для каждого Нсп Из СтатусыПерехода Цикл
		Нсп.НомерСтатусаПерехода = СтатусыПерехода.Индекс(Нсп);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МатрицаПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	МатрицаПерехода.НомерСтатуса КАК НомерСтатуса
	|ПОМЕСТИТЬ втМатрицаПерехода
	|ИЗ
	|	&МатрицаПерехода КАК МатрицаПерехода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	СтатусыПерехода.НовыйСтатус КАК НовыйСтатус,
	|	СтатусыПерехода.НомерСтатусаПерехода КАК НомерСтатусаПерехода
	|ПОМЕСТИТЬ втСтатусыПерехода
	|ИЗ
	|	&СтатусыПерехода КАК СтатусыПерехода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СпособСогласования КАК СпособСогласования,
	|	втМатрицаПерехода.ТекущийСтатус КАК ТекущийСтатус,
	|	втСтатусыПерехода.НовыйСтатус КАК СледующийСтатус,
	|	втМатрицаПерехода.НомерСтатуса КАК НомерСтатуса,
	|	втСтатусыПерехода.НомерСтатусаПерехода КАК НомерСтатусаПерехода
	|ИЗ
	|	втМатрицаПерехода КАК втМатрицаПерехода
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусыПерехода КАК втСтатусыПерехода
	|		ПО втМатрицаПерехода.ТекущийСтатус = втСтатусыПерехода.ТекущийСтатус";

	Запрос.УстановитьПараметр("СпособСогласования", Объект.Ссылка);
	Запрос.УстановитьПараметр("МатрицаПерехода"   , МатрицаПерехода.Выгрузить());
	Запрос.УстановитьПараметр("СтатусыПерехода"   , СтатусыПерехода.Выгрузить());

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	НаборЗаписей = РегистрыСведений.торо_МатрицаПереходаСтатусовДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СпособСогласования.Установить(Объект.Ссылка);
	НаборЗаписей.Загрузить(РезультатЗапроса);
	НаборЗаписей.Записать();

	#Вставка
	гкс_СохранитьСрокиГодности();
	#КонецВставки
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ПроводитьАвтоматически", 
		Новый ОписаниеТипов("Булево"), "МатрицаПерехода"));
	// гкс+ [Релиз16] Деснол
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_РазрешеноСоздаватьПодчиненные", 
		Новый ОписаниеТипов("Булево"), "МатрицаПерехода"));
	// гкс- [Релиз16]
	// гкс+ [Релиз17] Деснол
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ТребуетсяКомментарий", 
		Новый ОписаниеТипов("Булево"), "МатрицаПерехода"));
	// гкс- [Релиз17]
	// гкс+ [разработка 2021] Куст 28.04.2021
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ТЧСроки", 
		Новый ОписаниеТипов("ТаблицаЗначений")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ТЧСрокиОповещаемые", 
		Новый ОписаниеТипов("ТаблицаЗначений")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Статус", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"), "гкс_ТЧСроки"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Срок", 
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3)), "гкс_ТЧСроки"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_Срок", 
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3))));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Статус", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"), "гкс_ТЧСрокиОповещаемые"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Пользователь", 
		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), "гкс_ТЧСрокиОповещаемые"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Адрес", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)), "гкс_ТЧСрокиОповещаемые"));
	// гкс- [разработка 2021] Куст 28.04.2021
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	НЭлем = Элементы.Добавить("Элемент_гкс_ПроводитьАвтоматически", Тип("ПолеФормы"), Элементы.МатрицаПерехода);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "МатрицаПерехода.гкс_ПроводитьАвтоматически";
	НЭлем.КартинкаШапки = БиблиотекаКартинок.СохранитьЗначения;
	НЭлем.Заголовок = " ";
	НЭлем.Подсказка = НСтр("ru='Проводить автоматически';
	|en='Publicar automáticamente';
	|es=''");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ПроводитьАвтоматическиПриИзменении");
	
	Элементы.МатрицаПереходаПроводитьДокумент.УстановитьДействие("ПриИзменении",
		"гкс_ПроводитьАвтоматическиПриИзменении");
	
	Элементы.Переместить(Элементы["Элемент_гкс_ПроводитьАвтоматически"],
		Элементы.МатрицаПерехода, Элементы.МатрицаПереходаНеИспользоватьВПодборах);
	// гкс+ [Релиз16] Деснол
	НовыйЭлемент = Элементы.Добавить("Элемент_гкс_РазрешеноСоздаватьПодчиненные", Тип("ПолеФормы"), Элементы.МатрицаПерехода);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "МатрицаПерехода.гкс_РазрешеноСоздаватьПодчиненные";
	НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.ЗаполнитьФорму;
	НовыйЭлемент.Заголовок = " ";
	НовыйЭлемент.Подсказка = НСтр("ru='Разрешить создание документов на основании';
	|en='allow the creation of documents';
	|es=''");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_РазрешеноСоздаватьПодчиненныеПриИзменении");
	
	// гкс- [Релиз16]
	// гкс+ [Релиз17] Деснол
	НовыйЭлемент = Элементы.Добавить("Элемент_гкс_ТребуетсяКомментарий", Тип("ПолеФормы"), Элементы.МатрицаПерехода);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "МатрицаПерехода.гкс_ТребуетсяКомментарий";
	НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.Переименовать;
	НовыйЭлемент.Заголовок = " ";
	НовыйЭлемент.Подсказка = НСтр("ru='Требуется комментарий';
	|en='commet required';
	|es=''");
	// гкс- [Релиз17]
	// гкс+ [разработка 2021] Куст 28.04.2021
	НВкл = Элементы.Добавить("гкс_СтраницаСроки", Тип("ГруппаФормы"), Элементы.Страницы);
	НВкл.Вид = ВидГруппыФормы.Страница;
	НВкл.Заголовок = НСтр("es='';ru='Срок согласования';en='Approval period'");
	//
	НЭлем = Элементы.Добавить("гкс_Срок", Тип("ПолеФормы"), Элементы["гкс_СтраницаСроки"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_Срок";
	НЭлем.Заголовок = НСтр("es='Period';ru='Срок';en='Period'");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_СрокПриИзменении");
	//
	НЭлем = Элементы.Добавить("гкс_ТЧСрокиОповещаемые", Тип("ТаблицаФормы"), Элементы["гкс_СтраницаСроки"]);
	НЭлем.ПутьКДанным = "гкс_ТЧСрокиОповещаемые";
	НЭлем.Заголовок = НСтр("es='Informado';ru='Оповещаемые';en='Notified'");
	НЭлем.УстановитьДействие("ПередОкончаниемРедактирования", "гкс_ТЧСрокиОповещаемыеПередОкончаниемРедактирования");
	//
	НЭлем = Элементы.Добавить("гкс_ТЧСрокиОповещаемыеПользователь", Тип("ПолеФормы"), Элементы["гкс_ТЧСрокиОповещаемые"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ТЧСрокиОповещаемые.Пользователь";
	НЭлем.Заголовок = НСтр("es='La persona informada';ru='Оповещаемое лицо';en='Notified person'");
	НЭлем.УстановитьДействие("ОбработкаВыбора", "гкс_ТЧСрокиОповещаемыеПользовательОбработкаВыбора");
	//
	НЭлем = Элементы.Добавить("гкс_ТЧСрокиОповещаемыеАдрес", Тип("ПолеФормы"), Элементы["гкс_ТЧСрокиОповещаемые"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ТЧСрокиОповещаемые.Адрес";
	НЭлем.Заголовок = НСтр("es='E-Mail';ru='E-Mail';en='E-Mail'");
	// гкс- [разработка 2021] Куст 28.04.2021
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПроводитьАвтоматическиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные.ПроводитьДокумент = Ложь Тогда 
			ТекущиеДанные["гкс_ПроводитьАвтоматически"] = Ложь;
			// гкс+ [Релиз16] Деснол
			ТекущиеДанные["гкс_РазрешеноСоздаватьПодчиненные"] = Ложь;
			// гкс- [Релиз16]
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [Релиз16] Деснол
&НаКлиенте
Процедура гкс_РазрешеноСоздаватьПодчиненныеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные["гкс_РазрешеноСоздаватьПодчиненные"] Тогда 
			ТекущиеДанные.ПроводитьДокумент = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз16]

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьМатрицуПерехода")
Процедура Расш_гкс_ЗаполнитьМатрицуПерехода(Ссылка)

	МатрицаПерехода.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НастройкиСтатусовСогласованияДокументов.Статус КАК ТекущийСтатус,
	|	торо_НастройкиСтатусовСогласованияДокументов.Начальный КАК Начальный,
	|	торо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено КАК СогласованиеЗавершено,
	|	торо_НастройкиСтатусовСогласованияДокументов.ПроводитьДокумент КАК ПроводитьДокумент,
	|	торо_НастройкиСтатусовСогласованияДокументов.ШаблонСообщенияЭлектроннойПочты КАК ШаблонСообщенияЭлектроннойПочты,
	|	торо_НастройкиСтатусовСогласованияДокументов.НеИспользоватьВПодборах КАК НеИспользоватьВПодборах,
	|	торо_НастройкиСтатусовСогласованияДокументов.ЗапретитьРедактирование КАК ЗапретитьРедактирование,
	|	торо_НастройкиСтатусовСогласованияДокументов.РазрешитьПометкуНаУдаление КАК РазрешитьПометкуНаУдаление,
	#Вставка
	|	торо_НастройкиСтатусовСогласованияДокументов.гкс_ПроводитьАвтоматически КАК гкс_ПроводитьАвтоматически,
	// гкс+ [Релиз16] Деснол
	|	торо_НастройкиСтатусовСогласованияДокументов.гкс_РазрешеноСоздаватьПодчиненные КАК гкс_РазрешеноСоздаватьПодчиненные,
	// гкс- [Релиз16]
	// гкс+ [Релиз17] Деснол
	|	торо_НастройкиСтатусовСогласованияДокументов.гкс_ТребуетсяКомментарий КАК гкс_ТребуетсяКомментарий,
	// гкс- [Релиз17]
	#КонецВставки
	|	торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач КАК НеОтображатьВСпискеЗадач
	|ИЗ
	|	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|ГДЕ
	|	торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_НастройкиСтатусовСогласованияДокументов.НомерСтатуса";

	Запрос.УстановитьПараметр("СпособСогласования", Ссылка);

	ТЗМатрицаПерехода = Запрос.Выполнить().Выгрузить();
	МатрицаПерехода.Загрузить(ТЗМатрицаПерехода);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус КАК ТекущийСтатус,
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК НовыйСтатус
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|ГДЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_МатрицаПереходаСтатусовДокументов.НомерСтатуса,
	|	торо_МатрицаПереходаСтатусовДокументов.НомерСтатусаПерехода";

	Запрос.УстановитьПараметр("СпособСогласования", Ссылка);

	ВыборкаСтатусыПерехода = Запрос.Выполнить().Выбрать();

	Пока ВыборкаСтатусыПерехода.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаСтатусыПерехода.НовыйСтатус) Тогда
			НоваяСтрока = СтатусыПерехода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтатусыПерехода);
		КонецЕсли;
	КонецЦикла;
	#Вставка
	// гкс+ [] Деснол 24.08.2022
	гкс_ЗагрузитьСрокиГодности(Ссылка);
	// гкс- [] Деснол 24.08.2022
	#КонецВставки

КонецПроцедуры

// гкс+ [разработка 2021] Куст 28.04.2021
&НаСервере
Процедура гкс_СохранитьСрокиГодности()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Статус КАК Статус,
	               |	ТЧ.Срок КАК Срок
	               |ПОМЕСТИТЬ ТЧСроки
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.Статус КАК Статус,
	               |	ТЧ.Пользователь КАК Пользователь,
	               |	ТЧ.Адрес КАК Адрес
	               |ПОМЕСТИТЬ ТЧСрокиОповещаемые
	               |ИЗ
	               |	&ТЧ2 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.ТекущийСтатус КАК ТекущийСтатус
	               |ПОМЕСТИТЬ Матрица
	               |ИЗ
	               |	&ТЧ3 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТЧСроки.Статус КАК Статус,
	               |	ТЧСроки.Срок КАК Срок
	               |ИЗ
	               |	ТЧСроки КАК ТЧСроки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Матрица КАК Матрица
	               |		ПО ТЧСроки.Статус = Матрица.ТекущийСтатус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ Различные
	               |	ТЧСрокиОповещаемые.Статус КАК Статус,
	               |	ТЧСрокиОповещаемые.Пользователь КАК Пользователь,
	               |	ТЧСрокиОповещаемые.Адрес КАК Адрес
	               |ИЗ
	               |	Матрица КАК Матрица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧСрокиОповещаемые КАК ТЧСрокиОповещаемые
	               |		ПО Матрица.ТекущийСтатус = ТЧСрокиОповещаемые.Статус";
	Запрос.УстановитьПараметр("ТЧ1", ЭтотОбъект["гкс_ТЧСроки"].Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", ЭтотОбъект["гкс_ТЧСрокиОповещаемые"].Выгрузить());
	Запрос.УстановитьПараметр("ТЧ3", МатрицаПерехода.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 3;
	Пакет2 = Пакет1 + 1;
	НаборЗаписей = РегистрыСведений.гкс_СрокиСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Способ.Установить(Объект.Ссылка);
	Выборка = РезультатЗапроса[Пакет1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Способ = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	НаборЗаписей.Записать();
	//
	НаборЗаписей = РегистрыСведений.гкс_СрокиСОповещаемые.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Способ.Установить(Объект.Ссылка);
	Выборка = РезультатЗапроса[Пакет2].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Способ = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [] Деснол 24.08.2022
&НаСервере
Процедура гкс_ЗагрузитьСрокиГодности(СсылкаКопирования = Неопределено)
	СсылкаОтбор = Объект.Ссылка;
	Если Не СсылкаКопирования = Неопределено Тогда 
		СсылкаОтбор = СсылкаКопирования;
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	ЭтотОбъект["гкс_ТЧСрокиОповещаемые"].Очистить();
	ЭтотОбъект["гкс_ТЧСроки"].Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст = "выбрать
	|Рег.Статус КАК Статус,
	|Рег.Срок КАК Срок
	|ИЗ РегистрСведений.гкс_СрокиСогласования КАК Рег
	|Где Рег.Способ = &Ссылка
	|;
	|Выбрать
	|Рег.Статус КАК Статус,
	|Рег.Пользователь КАК Пользователь,
	|Рег.Адрес КАК Адрес
	|ИЗ РегистрСведений.гкс_СрокиСОповещаемые КАК Рег
	|Где Рег.Способ = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", СсылкаОтбор);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 0;
	Пакет2 = Пакет1 + 1;
	Выборка = РезультатЗапроса[Пакет1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект["гкс_ТЧСроки"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	//
	Выборка = РезультатЗапроса[Пакет2].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект["гкс_ТЧСрокиОповещаемые"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры
// гкс- [] Деснол 24.08.2022

// гкс+ [разработка 2021] Куст 28.04.2021
&НаКлиенте
Процедура гкс_СрокПриИзменении(Элемент)
	ТекДанные = Элементы.МатрицаПерехода.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ЭтоНовый = Истина;
		Для Каждого СтрокаТЧ Из ЭтотОбъект["гкс_ТЧСроки"] Цикл
			Если СтрокаТЧ.Статус = ТекДанные.ТекущийСтатус Тогда 
				СтрокаТЧ.Срок = ЭтотОбъект["гкс_Срок"];
				ЭтоНовый = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоНовый Тогда 
			СтрокаТЧ = ЭтотОбъект["гкс_ТЧСроки"].Добавить();
			СтрокаТЧ.Статус = ТекДанные.ТекущийСтатус;
			СтрокаТЧ.Срок = ЭтотОбъект["гкс_Срок"];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
&НаКлиенте
Процедура гкс_ТЧСрокиОповещаемыеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если не ОтменаРедактирования Тогда 
		ТекСтатус = Элементы.МатрицаПерехода.ТекущиеДанные;
		Если ТекСтатус = Неопределено Тогда 
			ОтменаРедактирования = Истина;
		Иначе
			Элемент.ТекущиеДанные.Статус = ТекСтатус.ТекущийСтатус;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
&НаКлиенте
&ИзменениеИКонтроль("УстановитьОтборыВСвязанныхТЧ")
Процедура гкс_УстановитьОтборыВСвязанныхТЧ(ТекущаяСтрока)

	Элементы.СтатусыПерехода.ОтборСтрок     = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	Элементы.ПорядокСогласования.ОтборСтрок = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	Элементы.ОповещаемыеЛица.ОтборСтрок     = Новый ФиксированнаяСтруктура("ТекущийСтатус", ТекущаяСтрока.ТекущийСтатус);
	#Вставка
	Элементы["гкс_ТЧСрокиОповещаемые"].ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ТекущаяСтрока.ТекущийСтатус);
	ЭтотОбъект["гкс_Срок"] = 0;
	Для Каждого СтрокаТЧ Из ЭтотОбъект["гкс_ТЧСроки"] Цикл
		Если СтрокаТЧ.Статус = ТекущаяСтрока.ТекущийСтатус Тогда 
			ЭтотОбъект["гкс_Срок"] = СтрокаТЧ.Срок;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	#КонецВставки

КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 29.04.2021
&НаКлиенте
Процедура гкс_ТЧСрокиОповещаемыеПользовательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.гкс_ТЧСрокиОповещаемые.ТекущиеДанные;
	
	Если Не ВыбранноеЗначение = Неопределено
		И Не ТекущиеДанные = Неопределено Тогда
		
		АдресЭП = ОбработкаВыбораОповещаемогоНаСервере(ВыбранноеЗначение);
		
		Если НЕ АдресЭП = Неопределено Тогда
			ТекущиеДанные.Адрес = АдресЭП;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
// гкс- [разработка 2021] Куст 29.04.2021
#КонецОбласти
